templates/getadmin.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:user="urn:iControl:Management/UserManagement" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
   <soapenv:Header/>
   <soapenv:Body>
      <user:get_encrypted_password soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <user_names xsi:type="urn:Common.StringSequence" soapenc:arrayType="xsd:string[]" xmlns:urn="urn:iControl"><item>%%%USERNAME%%%</item></user_names>
      </user:get_encrypted_password>
   </soapenv:Body>
</soapenv:Envelope>
